zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_K566_GPR1.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_K566_GPR1
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_K566_GPR1_H_)  /* Check if memory map has not been already included */
#define S32K566_K566_GPR1_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- K566_GPR1 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup K566_GPR1_Peripheral_Access_Layer K566_GPR1 Peripheral Access Layer
 * @{
 */

/** K566_GPR1 - Register Layout Typedef */
typedef struct K566_GPR1_Struct {
  uint8_t RESERVED_0[4096];
  __IO uint32_t GPR_RWD_0;                         /**< Read Write DEST 0, offset: 0x1000 */
  __IO uint32_t GPR_RWD_1;                         /**< Read Write DEST 1, offset: 0x1004 */
  __IO uint32_t GPR_RWD_2;                         /**< Read Write DEST 2, offset: 0x1008 */
  __IO uint32_t GPR_RWD_3;                         /**< Read Write DEST 3, offset: 0x100C */
  __IO uint32_t GPR_RWD_4;                         /**< Read Write DEST 4, offset: 0x1010 */
  __IO uint32_t GPR_RWD_5;                         /**< Read Write DEST 5, offset: 0x1014 */
  __IO uint32_t GPR_RWD_6;                         /**< Read Write DEST 6, offset: 0x1018 */
  __IO uint32_t GPR_RWD_7;                         /**< Read Write DEST 7, offset: 0x101C */
  __IO uint32_t GPR_RWD_8;                         /**< Read Write DEST 8, offset: 0x1020 */
  __IO uint32_t GPR_RWD_9;                         /**< Read Write DEST 9, offset: 0x1024 */
  __IO uint32_t GPR_RWD_10;                        /**< Read Write DEST 10, offset: 0x1028 */
  __IO uint32_t GPR_RWD_11;                        /**< Read Write DEST 11, offset: 0x102C */
  __IO uint32_t GPR_RWD_12;                        /**< Read Write DEST 12, offset: 0x1030 */
  __IO uint32_t GPR_RWD_13;                        /**< Read Write DEST 13, offset: 0x1034 */
  __IO uint32_t GPR_RWD_14;                        /**< Read Write DEST 14, offset: 0x1038 */
  __IO uint32_t GPR_RWD_15;                        /**< Read Write DEST 15, offset: 0x103C */
  __IO uint32_t GPR_RWD_16;                        /**< Read Write DEST 16, offset: 0x1040 */
  __IO uint32_t GPR_RWD_17;                        /**< Read Write DEST 17, offset: 0x1044 */
  __IO uint32_t GPR_RWD_18;                        /**< Read Write DEST 18, offset: 0x1048 */
  uint8_t RESERVED_1[12];
  __IO uint32_t GPR_RWD_22;                        /**< Read Write DEST 22, offset: 0x1058 */
  __IO uint32_t GPR_RWD_23;                        /**< Read Write DEST 23, offset: 0x105C */
  __IO uint32_t GPR_RWD_24;                        /**< Read Write DEST 24, offset: 0x1060 */
  __IO uint32_t GPR_RWD_25;                        /**< Read Write DEST 25, offset: 0x1064 */
  __IO uint32_t GPR_RWD_26;                        /**< Read Write DEST 26, offset: 0x1068 */
  __IO uint32_t GPR_RWD_27;                        /**< Read Write DEST 27, offset: 0x106C */
  __IO uint32_t GPR_RWD_28;                        /**< Read Write DEST 28, offset: 0x1070 */
  __IO uint32_t GPR_RWD_29;                        /**< Read Write DEST 29, offset: 0x1074 */
  __IO uint32_t GPR_RWD_30;                        /**< Read Write DEST 30, offset: 0x1078 */
  uint8_t RESERVED_2[12];
  __IO uint32_t GPR_RWD_34;                        /**< Read Write DEST 34, offset: 0x1088 */
  __IO uint32_t GPR_RWD_35;                        /**< Read Write DEST 35, offset: 0x108C */
  __IO uint32_t GPR_RWD_36;                        /**< Read Write DEST 36, offset: 0x1090 */
  __IO uint32_t GPR_RWD_37;                        /**< Read Write DEST 37, offset: 0x1094 */
  __IO uint32_t GPR_RWD_38;                        /**< Read Write DEST 38, offset: 0x1098 */
  __IO uint32_t GPR_RWD_39;                        /**< Read Write DEST 39, offset: 0x109C */
  __IO uint32_t GPR_RWD_40;                        /**< Read Write DEST 40, offset: 0x10A0 */
  __IO uint32_t GPR_RWD_41;                        /**< Read Write DEST 41, offset: 0x10A4 */
  __IO uint32_t GPR_RWD_42;                        /**< Read Write DEST 42, offset: 0x10A8 */
  __IO uint32_t GPR_RWD_43;                        /**< Read Write DEST 43, offset: 0x10AC */
  uint8_t RESERVED_3[1872];
  __I  uint32_t GPR_ROD_0;                         /**< Read Only DEST 0, offset: 0x1800 */
  __I  uint32_t GPR_ROD_1;                         /**< Read Only DEST 1, offset: 0x1804 */
  __I  uint32_t GPR_ROD_2;                         /**< Read Only DEST 2, offset: 0x1808 */
  __I  uint32_t GPR_ROD_3;                         /**< Read Only DEST 3, offset: 0x180C */
  __IO uint32_t GPR_ROD_4;                         /**< Read Only DEST 4, offset: 0x1810 */
  __IO uint32_t GPR_ROD_5;                         /**< Read Only DEST 5, offset: 0x1814 */
  __IO uint32_t GPR_ROD_6;                         /**< Read Only DEST 6, offset: 0x1818 */
  __IO uint32_t GPR_ROD_7;                         /**< Read Only DEST 7, offset: 0x181C */
  __IO uint32_t GPR_ROD_8;                         /**< Read Only DEST 8, offset: 0x1820 */
  __IO uint32_t GPR_ROD_9;                         /**< Read Only DEST 9, offset: 0x1824 */
  uint8_t RESERVED_4[2008];
  __IO uint32_t GPR_RWF_0;                         /**< Read Write FUNC 0, offset: 0x2000 */
  __IO uint32_t GPR_RWF_1;                         /**< Read Write FUNC 1, offset: 0x2004 */
  __IO uint32_t GPR_RWF_2;                         /**< Read Write FUNC 2, offset: 0x2008 */
  uint8_t RESERVED_5[4];
  __IO uint32_t GPR_RWF_4;                         /**< Read Write FUNC 4, offset: 0x2010 */
  __IO uint32_t GPR_RWF_5;                         /**< Read Write FUNC 5, offset: 0x2014 */
  __IO uint32_t GPR_RWF_6;                         /**< Read Write FUNC 6, offset: 0x2018 */
  __IO uint32_t GPR_RWF_7;                         /**< Read Write FUNC 7, offset: 0x201C */
  uint8_t RESERVED_6[2016];
  __IO uint32_t GPR_ROF_0;                         /**< Read Only FUNC 0, offset: 0x2800 */
  __I  uint32_t GPR_ROF_1;                         /**< Read Only FUNC 1, offset: 0x2804 */
} K566_GPR1_Type, *K566_GPR1_MemMapPtr;

/** Number of instances of the K566_GPR1 module. */
#define K566_GPR1_INSTANCE_COUNT                 (1u)

/* K566_GPR1 - Peripheral instance base addresses */
/** Peripheral GPR_1 base address */
#define IP_GPR_1_BASE                            (0x40458000u)
/** Peripheral GPR_1 base pointer */
#define IP_GPR_1                                 ((K566_GPR1_Type *)IP_GPR_1_BASE)
/** Array initializer of K566_GPR1 peripheral base addresses */
#define IP_K566_GPR1_BASE_ADDRS                  { IP_GPR_1_BASE }
/** Array initializer of K566_GPR1 peripheral base pointers */
#define IP_K566_GPR1_BASE_PTRS                   { IP_GPR_1 }

/* ----------------------------------------------------------------------------
   -- K566_GPR1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup K566_GPR1_Register_Masks K566_GPR1 Register Masks
 * @{
 */

/*! @name GPR_RWD_0 - Read Write DEST 0 */
/*! @{ */

