zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWD_0_LOCK_STEP_CONTROL_MASK (0x10U)
#define K566_GPR1_GPR_RWD_0_LOCK_STEP_CONTROL_SHIFT (4U)
#define K566_GPR1_GPR_RWD_0_LOCK_STEP_CONTROL_WIDTH (1U)
#define K566_GPR1_GPR_RWD_0_LOCK_STEP_CONTROL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_LOCK_STEP_CONTROL_SHIFT)) & K566_GPR1_GPR_RWD_0_LOCK_STEP_CONTROL_MASK)

#define K566_GPR1_GPR_RWD_0_OTA_SEL_MASK         (0x20U)
#define K566_GPR1_GPR_RWD_0_OTA_SEL_SHIFT        (5U)
#define K566_GPR1_GPR_RWD_0_OTA_SEL_WIDTH        (1U)
#define K566_GPR1_GPR_RWD_0_OTA_SEL(x)           (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_OTA_SEL_SHIFT)) & K566_GPR1_GPR_RWD_0_OTA_SEL_MASK)

#define K566_GPR1_GPR_RWD_0_OTA_NUM_FIXED_LPART_MASK (0xFC0U)
#define K566_GPR1_GPR_RWD_0_OTA_NUM_FIXED_LPART_SHIFT (6U)
#define K566_GPR1_GPR_RWD_0_OTA_NUM_FIXED_LPART_WIDTH (6U)
#define K566_GPR1_GPR_RWD_0_OTA_NUM_FIXED_LPART(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_OTA_NUM_FIXED_LPART_SHIFT)) & K566_GPR1_GPR_RWD_0_OTA_NUM_FIXED_LPART_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL12_MASK       (0x1000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL12_SHIFT      (12U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL12_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL12(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL12_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL12_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL13_MASK       (0x2000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL13_SHIFT      (13U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL13_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL13(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL13_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL13_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL14_MASK       (0x4000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL14_SHIFT      (14U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL14_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL14(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL14_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL14_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL15_MASK       (0x8000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL15_SHIFT      (15U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL15_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL15(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL15_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL15_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL16_MASK       (0x10000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL16_SHIFT      (16U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL16_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL16(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL16_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL16_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL17_MASK       (0x20000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL17_SHIFT      (17U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL17_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL17(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL17_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL17_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL18_MASK       (0x40000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL18_SHIFT      (18U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL18_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL18(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL18_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL18_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL19_MASK       (0x80000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL19_SHIFT      (19U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL19_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL19(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL19_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL19_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL20_MASK       (0x100000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL20_SHIFT      (20U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL20_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL20(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL20_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL20_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL21_MASK       (0x200000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL21_SHIFT      (21U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL21_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL21(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL21_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL21_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL22_MASK       (0x400000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL22_SHIFT      (22U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL22_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL22(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL22_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL22_MASK)

#define K566_GPR1_GPR_RWD_0_MUX_SEL23_MASK       (0x800000U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL23_SHIFT      (23U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL23_WIDTH      (1U)
#define K566_GPR1_GPR_RWD_0_MUX_SEL23(x)         (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_MUX_SEL23_SHIFT)) & K566_GPR1_GPR_RWD_0_MUX_SEL23_MASK)

#define K566_GPR1_GPR_RWD_0_FIRC_FREQ_SEL_MASK   (0x1000000U)
#define K566_GPR1_GPR_RWD_0_FIRC_FREQ_SEL_SHIFT  (24U)
#define K566_GPR1_GPR_RWD_0_FIRC_FREQ_SEL_WIDTH  (1U)
#define K566_GPR1_GPR_RWD_0_FIRC_FREQ_SEL(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_FIRC_FREQ_SEL_SHIFT)) & K566_GPR1_GPR_RWD_0_FIRC_FREQ_SEL_MASK)

#define K566_GPR1_GPR_RWD_0_FIRC_STDBY_EN_MASK   (0x2000000U)
#define K566_GPR1_GPR_RWD_0_FIRC_STDBY_EN_SHIFT  (25U)
#define K566_GPR1_GPR_RWD_0_FIRC_STDBY_EN_WIDTH  (1U)
#define K566_GPR1_GPR_RWD_0_FIRC_STDBY_EN(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_FIRC_STDBY_EN_SHIFT)) & K566_GPR1_GPR_RWD_0_FIRC_STDBY_EN_MASK)

#define K566_GPR1_GPR_RWD_0_LOCK_EN0_MASK        (0x40000000U)
#define K566_GPR1_GPR_RWD_0_LOCK_EN0_SHIFT       (30U)
#define K566_GPR1_GPR_RWD_0_LOCK_EN0_WIDTH       (1U)
#define K566_GPR1_GPR_RWD_0_LOCK_EN0(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_LOCK_EN0_SHIFT)) & K566_GPR1_GPR_RWD_0_LOCK_EN0_MASK)

#define K566_GPR1_GPR_RWD_0_LOCK_EN1_MASK        (0x80000000U)
#define K566_GPR1_GPR_RWD_0_LOCK_EN1_SHIFT       (31U)
#define K566_GPR1_GPR_RWD_0_LOCK_EN1_WIDTH       (1U)
#define K566_GPR1_GPR_RWD_0_LOCK_EN1(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_0_LOCK_EN1_SHIFT)) & K566_GPR1_GPR_RWD_0_LOCK_EN1_MASK)
/*! @} */

