zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
/*! @name GPR_RWD_1 - Read Write DEST 1 */
/*! @{ */

#define K566_GPR1_GPR_RWD_1_CM7_0_FAULT_MASK     (0x1U)
#define K566_GPR1_GPR_RWD_1_CM7_0_FAULT_SHIFT    (0U)
#define K566_GPR1_GPR_RWD_1_CM7_0_FAULT_WIDTH    (1U)
#define K566_GPR1_GPR_RWD_1_CM7_0_FAULT(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_1_CM7_0_FAULT_SHIFT)) & K566_GPR1_GPR_RWD_1_CM7_0_FAULT_MASK)

#define K566_GPR1_GPR_RWD_1_CM7_1_FAULT_MASK     (0x2U)
#define K566_GPR1_GPR_RWD_1_CM7_1_FAULT_SHIFT    (1U)
#define K566_GPR1_GPR_RWD_1_CM7_1_FAULT_WIDTH    (1U)
#define K566_GPR1_GPR_RWD_1_CM7_1_FAULT(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_1_CM7_1_FAULT_SHIFT)) & K566_GPR1_GPR_RWD_1_CM7_1_FAULT_MASK)

#define K566_GPR1_GPR_RWD_1_CM7_2_FAULT_MASK     (0x4U)
#define K566_GPR1_GPR_RWD_1_CM7_2_FAULT_SHIFT    (2U)
#define K566_GPR1_GPR_RWD_1_CM7_2_FAULT_WIDTH    (1U)
#define K566_GPR1_GPR_RWD_1_CM7_2_FAULT(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_1_CM7_2_FAULT_SHIFT)) & K566_GPR1_GPR_RWD_1_CM7_2_FAULT_MASK)

#define K566_GPR1_GPR_RWD_1_CM7_3_FAULT_MASK     (0x8U)
#define K566_GPR1_GPR_RWD_1_CM7_3_FAULT_SHIFT    (3U)
#define K566_GPR1_GPR_RWD_1_CM7_3_FAULT_WIDTH    (1U)
#define K566_GPR1_GPR_RWD_1_CM7_3_FAULT(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_1_CM7_3_FAULT_SHIFT)) & K566_GPR1_GPR_RWD_1_CM7_3_FAULT_MASK)

#define K566_GPR1_GPR_RWD_1_CM7_0_WAIT_MASK      (0x10U)
#define K566_GPR1_GPR_RWD_1_CM7_0_WAIT_SHIFT     (4U)
#define K566_GPR1_GPR_RWD_1_CM7_0_WAIT_WIDTH     (1U)
#define K566_GPR1_GPR_RWD_1_CM7_0_WAIT(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_1_CM7_0_WAIT_SHIFT)) & K566_GPR1_GPR_RWD_1_CM7_0_WAIT_MASK)

#define K566_GPR1_GPR_RWD_1_CM7_1_WAIT_MASK      (0x20U)
#define K566_GPR1_GPR_RWD_1_CM7_1_WAIT_SHIFT     (5U)
#define K566_GPR1_GPR_RWD_1_CM7_1_WAIT_WIDTH     (1U)
#define K566_GPR1_GPR_RWD_1_CM7_1_WAIT(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_1_CM7_1_WAIT_SHIFT)) & K566_GPR1_GPR_RWD_1_CM7_1_WAIT_MASK)

#define K566_GPR1_GPR_RWD_1_CM7_2_WAIT_MASK      (0x40U)
#define K566_GPR1_GPR_RWD_1_CM7_2_WAIT_SHIFT     (6U)
#define K566_GPR1_GPR_RWD_1_CM7_2_WAIT_WIDTH     (1U)
#define K566_GPR1_GPR_RWD_1_CM7_2_WAIT(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_1_CM7_2_WAIT_SHIFT)) & K566_GPR1_GPR_RWD_1_CM7_2_WAIT_MASK)

#define K566_GPR1_GPR_RWD_1_CM7_3_WAIT_MASK      (0x80U)
#define K566_GPR1_GPR_RWD_1_CM7_3_WAIT_SHIFT     (7U)
#define K566_GPR1_GPR_RWD_1_CM7_3_WAIT_WIDTH     (1U)
#define K566_GPR1_GPR_RWD_1_CM7_3_WAIT(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_1_CM7_3_WAIT_SHIFT)) & K566_GPR1_GPR_RWD_1_CM7_3_WAIT_MASK)
/*! @} */

/*! @name GPR_RWD_2 - Read Write DEST 2 */
/*! @{ */

#define K566_GPR1_GPR_RWD_2_MUX_SEL0_MASK        (0x3U)
#define K566_GPR1_GPR_RWD_2_MUX_SEL0_SHIFT       (0U)
#define K566_GPR1_GPR_RWD_2_MUX_SEL0_WIDTH       (2U)
#define K566_GPR1_GPR_RWD_2_MUX_SEL0(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_2_MUX_SEL0_SHIFT)) & K566_GPR1_GPR_RWD_2_MUX_SEL0_MASK)

#define K566_GPR1_GPR_RWD_2_MUX_SEL1_MASK        (0xCU)
#define K566_GPR1_GPR_RWD_2_MUX_SEL1_SHIFT       (2U)
#define K566_GPR1_GPR_RWD_2_MUX_SEL1_WIDTH       (2U)
#define K566_GPR1_GPR_RWD_2_MUX_SEL1(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_2_MUX_SEL1_SHIFT)) & K566_GPR1_GPR_RWD_2_MUX_SEL1_MASK)

#define K566_GPR1_GPR_RWD_2_LOCK_EN0_MASK        (0x40000000U)
#define K566_GPR1_GPR_RWD_2_LOCK_EN0_SHIFT       (30U)
#define K566_GPR1_GPR_RWD_2_LOCK_EN0_WIDTH       (1U)
#define K566_GPR1_GPR_RWD_2_LOCK_EN0(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_2_LOCK_EN0_SHIFT)) & K566_GPR1_GPR_RWD_2_LOCK_EN0_MASK)

#define K566_GPR1_GPR_RWD_2_LOCK_EN1_MASK        (0x80000000U)
#define K566_GPR1_GPR_RWD_2_LOCK_EN1_SHIFT       (31U)
#define K566_GPR1_GPR_RWD_2_LOCK_EN1_WIDTH       (1U)
#define K566_GPR1_GPR_RWD_2_LOCK_EN1(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_2_LOCK_EN1_SHIFT)) & K566_GPR1_GPR_RWD_2_LOCK_EN1_MASK)
/*! @} */

/*! @name GPR_RWD_3 - Read Write DEST 3 */
/*! @{ */

#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_CLK_EN_MASK (0x1U)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_CLK_EN_SHIFT (0U)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_CLK_EN_WIDTH (1U)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_CLK_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_CLK_EN_SHIFT)) & K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_CLK_EN_MASK)

#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_DIV_VAL_MASK (0x1FEU)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_DIV_VAL_SHIFT (1U)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_DIV_VAL_WIDTH (8U)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_DIV_VAL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_DIV_VAL_SHIFT)) & K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_DIV_VAL_MASK)

#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_MUX_SEL_MASK (0x7E00U)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_MUX_SEL_SHIFT (9U)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_MUX_SEL_WIDTH (6U)
#define K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_MUX_SEL_SHIFT)) & K566_GPR1_GPR_RWD_3_CLOCKOUT_RUN_MUX_SEL_MASK)
/*! @} */

/*! @name GPR_RWD_4 - Read Write DEST 4 */
/*! @{ */

#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE0_MASK  (0x1U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE0_SHIFT (0U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE0_WIDTH (1U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE0(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_4_DEBUG_DISABLE0_SHIFT)) & K566_GPR1_GPR_RWD_4_DEBUG_DISABLE0_MASK)

#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE1_MASK  (0x2U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE1_SHIFT (1U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE1_WIDTH (1U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE1(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_4_DEBUG_DISABLE1_SHIFT)) & K566_GPR1_GPR_RWD_4_DEBUG_DISABLE1_MASK)

#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE2_MASK  (0x4U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE2_SHIFT (2U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE2_WIDTH (1U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE2(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_4_DEBUG_DISABLE2_SHIFT)) & K566_GPR1_GPR_RWD_4_DEBUG_DISABLE2_MASK)

#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE3_MASK  (0x8U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE3_SHIFT (3U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE3_WIDTH (1U)
#define K566_GPR1_GPR_RWD_4_DEBUG_DISABLE3(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_4_DEBUG_DISABLE3_SHIFT)) & K566_GPR1_GPR_RWD_4_DEBUG_DISABLE3_MASK)

