zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE29_MASK (0x20000000U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE29_SHIFT (29U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE29_WIDTH (1U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE29(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_7_DEBUG_DISABLE29_SHIFT)) & K566_GPR1_GPR_RWD_7_DEBUG_DISABLE29_MASK)

#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE30_MASK (0x40000000U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE30_SHIFT (30U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE30_WIDTH (1U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE30(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_7_DEBUG_DISABLE30_SHIFT)) & K566_GPR1_GPR_RWD_7_DEBUG_DISABLE30_MASK)

#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE31_MASK (0x80000000U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE31_SHIFT (31U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE31_WIDTH (1U)
#define K566_GPR1_GPR_RWD_7_DEBUG_DISABLE31(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_7_DEBUG_DISABLE31_SHIFT)) & K566_GPR1_GPR_RWD_7_DEBUG_DISABLE31_MASK)
/*! @} */

/*! @name GPR_RWD_8 - Read Write DEST 8 */
/*! @{ */

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE0_MASK  (0x1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE0_SHIFT (0U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE0_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE0(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE0_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE0_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE1_MASK  (0x2U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE1_SHIFT (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE1_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE1(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE1_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE1_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE2_MASK  (0x4U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE2_SHIFT (2U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE2_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE2(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE2_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE2_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE3_MASK  (0x8U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE3_SHIFT (3U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE3_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE3(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE3_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE3_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE4_MASK  (0x10U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE4_SHIFT (4U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE4_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE4(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE4_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE4_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE5_MASK  (0x20U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE5_SHIFT (5U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE5_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE5(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE5_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE5_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE6_MASK  (0x40U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE6_SHIFT (6U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE6_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE6(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE6_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE6_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE7_MASK  (0x80U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE7_SHIFT (7U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE7_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE7(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE7_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE7_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE8_MASK  (0x100U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE8_SHIFT (8U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE8_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE8(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE8_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE8_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE9_MASK  (0x200U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE9_SHIFT (9U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE9_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE9(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE9_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE9_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE10_MASK (0x400U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE10_SHIFT (10U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE10_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE10(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE10_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE10_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE11_MASK (0x800U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE11_SHIFT (11U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE11_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE11(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE11_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE11_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE12_MASK (0x1000U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE12_SHIFT (12U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE12_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE12(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE12_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE12_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE13_MASK (0x2000U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE13_SHIFT (13U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE13_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE13(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE13_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE13_MASK)

#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE14_MASK (0x4000U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE14_SHIFT (14U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE14_WIDTH (1U)
#define K566_GPR1_GPR_RWD_8_DEBUG_DISABLE14(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_8_DEBUG_DISABLE14_SHIFT)) & K566_GPR1_GPR_RWD_8_DEBUG_DISABLE14_MASK)

