zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE3_MASK (0x8U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE3_SHIFT (3U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE3_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE3(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE3_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE3_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE4_MASK (0x10U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE4_SHIFT (4U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE4_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE4(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE4_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE4_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE5_MASK (0x20U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE5_SHIFT (5U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE5_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE5(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE5_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE5_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE6_MASK (0x40U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE6_SHIFT (6U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE6_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE6(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE6_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE6_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE7_MASK (0x80U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE7_SHIFT (7U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE7_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE7(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE7_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE7_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE8_MASK (0x100U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE8_SHIFT (8U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE8_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE8(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE8_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE8_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE9_MASK (0x200U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE9_SHIFT (9U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE9_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE9(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE9_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE9_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE10_MASK (0x400U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE10_SHIFT (10U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE10_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE10(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE10_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE10_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE11_MASK (0x800U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE11_SHIFT (11U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE11_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE11(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE11_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE11_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE12_MASK (0x1000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE12_SHIFT (12U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE12_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE12(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE12_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE12_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE13_MASK (0x2000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE13_SHIFT (13U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE13_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE13(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE13_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE13_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE14_MASK (0x4000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE14_SHIFT (14U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE14_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE14(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE14_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE14_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE15_MASK (0x8000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE15_SHIFT (15U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE15_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE15(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE15_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE15_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE16_MASK (0x10000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE16_SHIFT (16U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE16_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE16(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE16_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE16_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE17_MASK (0x20000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE17_SHIFT (17U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE17_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE17(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE17_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE17_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE18_MASK (0x40000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE18_SHIFT (18U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE18_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE18(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE18_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE18_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE19_MASK (0x80000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE19_SHIFT (19U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE19_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE19(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE19_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE19_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE20_MASK (0x100000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE20_SHIFT (20U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE20_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE20(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE20_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE20_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE21_MASK (0x200000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE21_SHIFT (21U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE21_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE21(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE21_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE21_MASK)

#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE22_MASK (0x400000U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE22_SHIFT (22U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE22_WIDTH (1U)
#define K566_GPR1_GPR_RWD_14_DEBUG_DISABLE22(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_14_DEBUG_DISABLE22_SHIFT)) & K566_GPR1_GPR_RWD_14_DEBUG_DISABLE22_MASK)

