zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE16_MASK (0x10000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE16_SHIFT (16U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE16_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE16(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE16_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE16_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE17_MASK (0x20000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE17_SHIFT (17U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE17_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE17(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE17_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE17_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE18_MASK (0x40000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE18_SHIFT (18U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE18_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE18(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE18_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE18_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE19_MASK (0x80000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE19_SHIFT (19U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE19_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE19(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE19_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE19_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE20_MASK (0x100000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE20_SHIFT (20U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE20_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE20(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE20_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE20_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE21_MASK (0x200000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE21_SHIFT (21U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE21_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE21(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE21_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE21_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE22_MASK (0x400000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE22_SHIFT (22U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE22_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE22(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE22_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE22_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE23_MASK (0x800000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE23_SHIFT (23U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE23_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE23(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE23_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE23_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE24_MASK (0x1000000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE24_SHIFT (24U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE24_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE24(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE24_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE24_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE25_MASK (0x2000000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE25_SHIFT (25U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE25_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE25(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE25_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE25_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE26_MASK (0x4000000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE26_SHIFT (26U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE26_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE26(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE26_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE26_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE27_MASK (0x8000000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE27_SHIFT (27U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE27_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE27(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE27_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE27_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE28_MASK (0x10000000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE28_SHIFT (28U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE28_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE28(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE28_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE28_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE29_MASK (0x20000000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE29_SHIFT (29U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE29_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE29(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE29_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE29_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE30_MASK (0x40000000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE30_SHIFT (30U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE30_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE30(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE30_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE30_MASK)

#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE31_MASK (0x80000000U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE31_SHIFT (31U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE31_WIDTH (1U)
#define K566_GPR1_GPR_RWD_28_DEBUG_DISABLE31(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_28_DEBUG_DISABLE31_SHIFT)) & K566_GPR1_GPR_RWD_28_DEBUG_DISABLE31_MASK)
/*! @} */

/*! @name GPR_RWD_29 - Read Write DEST 29 */
/*! @{ */

#define K566_GPR1_GPR_RWD_29_DEBUG_DISABLE0_MASK (0x1U)
#define K566_GPR1_GPR_RWD_29_DEBUG_DISABLE0_SHIFT (0U)
#define K566_GPR1_GPR_RWD_29_DEBUG_DISABLE0_WIDTH (1U)
#define K566_GPR1_GPR_RWD_29_DEBUG_DISABLE0(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_29_DEBUG_DISABLE0_SHIFT)) & K566_GPR1_GPR_RWD_29_DEBUG_DISABLE0_MASK)

#define K566_GPR1_GPR_RWD_29_DEBUG_DISABLE1_MASK (0x2U)
#define K566_GPR1_GPR_RWD_29_DEBUG_DISABLE1_SHIFT (1U)
#define K566_GPR1_GPR_RWD_29_DEBUG_DISABLE1_WIDTH (1U)
#define K566_GPR1_GPR_RWD_29_DEBUG_DISABLE1(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_29_DEBUG_DISABLE1_SHIFT)) & K566_GPR1_GPR_RWD_29_DEBUG_DISABLE1_MASK)

