zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN29_MASK (0x20000000U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN29_SHIFT (29U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN29_WIDTH (1U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN29(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN29_SHIFT)) & K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN29_MASK)

#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN30_MASK (0x40000000U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN30_SHIFT (30U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN30_WIDTH (1U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN30(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN30_SHIFT)) & K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN30_MASK)

#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN31_MASK (0x80000000U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN31_SHIFT (31U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN31_WIDTH (1U)
#define K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN31(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN31_SHIFT)) & K566_GPR1_GPR_RWD_39_FAULT_CH_A_EN31_MASK)
/*! @} */

/*! @name GPR_RWD_40 - Read Write DEST 40 */
/*! @{ */

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN0_MASK (0x1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN0_SHIFT (0U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN0_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN0(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN0_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN0_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN1_MASK (0x2U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN1_SHIFT (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN1_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN1(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN1_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN1_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN2_MASK (0x4U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN2_SHIFT (2U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN2_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN2(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN2_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN2_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN3_MASK (0x8U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN3_SHIFT (3U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN3_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN3(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN3_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN3_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN4_MASK (0x10U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN4_SHIFT (4U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN4_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN4(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN4_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN4_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN5_MASK (0x20U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN5_SHIFT (5U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN5_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN5(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN5_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN5_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN6_MASK (0x40U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN6_SHIFT (6U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN6_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN6(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN6_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN6_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN7_MASK (0x80U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN7_SHIFT (7U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN7_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN7(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN7_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN7_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN8_MASK (0x100U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN8_SHIFT (8U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN8_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN8(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN8_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN8_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN9_MASK (0x200U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN9_SHIFT (9U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN9_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN9(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN9_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN9_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN10_MASK (0x400U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN10_SHIFT (10U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN10_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN10(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN10_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN10_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN11_MASK (0x800U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN11_SHIFT (11U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN11_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN11(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN11_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN11_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN12_MASK (0x1000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN12_SHIFT (12U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN12_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN12(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN12_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN12_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN13_MASK (0x2000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN13_SHIFT (13U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN13_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN13(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN13_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN13_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN14_MASK (0x4000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN14_SHIFT (14U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN14_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN14(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN14_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN14_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN15_MASK (0x8000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN15_SHIFT (15U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN15_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN15(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN15_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN15_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN16_MASK (0x10000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN16_SHIFT (16U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN16_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN16(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN16_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN16_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN17_MASK (0x20000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN17_SHIFT (17U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN17_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN17(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN17_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN17_MASK)

