zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN18_MASK (0x40000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN18_SHIFT (18U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN18_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN18(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN18_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN18_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN19_MASK (0x80000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN19_SHIFT (19U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN19_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN19(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN19_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN19_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN20_MASK (0x100000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN20_SHIFT (20U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN20_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN20(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN20_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN20_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN21_MASK (0x200000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN21_SHIFT (21U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN21_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN21(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN21_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN21_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN22_MASK (0x400000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN22_SHIFT (22U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN22_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN22(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN22_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN22_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN23_MASK (0x800000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN23_SHIFT (23U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN23_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN23(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN23_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN23_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN24_MASK (0x1000000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN24_SHIFT (24U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN24_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN24(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN24_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN24_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN25_MASK (0x2000000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN25_SHIFT (25U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN25_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN25(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN25_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN25_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN26_MASK (0x4000000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN26_SHIFT (26U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN26_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN26(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN26_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN26_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN27_MASK (0x8000000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN27_SHIFT (27U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN27_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN27(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN27_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN27_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN28_MASK (0x10000000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN28_SHIFT (28U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN28_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN28(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN28_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN28_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN29_MASK (0x20000000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN29_SHIFT (29U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN29_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN29(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN29_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN29_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN30_MASK (0x40000000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN30_SHIFT (30U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN30_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN30(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN30_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN30_MASK)

#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN31_MASK (0x80000000U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN31_SHIFT (31U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN31_WIDTH (1U)
#define K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN31(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN31_SHIFT)) & K566_GPR1_GPR_RWD_40_FAULT_CH_A_EN31_MASK)
/*! @} */

/*! @name GPR_RWD_41 - Read Write DEST 41 */
/*! @{ */

#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN0_MASK (0x1U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN0_SHIFT (0U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN0_WIDTH (1U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN0(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN0_SHIFT)) & K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN0_MASK)

#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN1_MASK (0x2U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN1_SHIFT (1U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN1_WIDTH (1U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN1(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN1_SHIFT)) & K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN1_MASK)

#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN2_MASK (0x4U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN2_SHIFT (2U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN2_WIDTH (1U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN2(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN2_SHIFT)) & K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN2_MASK)

#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN3_MASK (0x8U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN3_SHIFT (3U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN3_WIDTH (1U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN3(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN3_SHIFT)) & K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN3_MASK)

#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN4_MASK (0x10U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN4_SHIFT (4U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN4_WIDTH (1U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN4(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN4_SHIFT)) & K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN4_MASK)

#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN5_MASK (0x20U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN5_SHIFT (5U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN5_WIDTH (1U)
#define K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN5(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN5_SHIFT)) & K566_GPR1_GPR_RWD_41_FAULT_CH_A_EN5_MASK)

