zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN26_MASK (0x4000000U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN26_SHIFT (26U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN26_WIDTH (1U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN26(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN26_SHIFT)) & K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN26_MASK)

#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN27_MASK (0x8000000U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN27_SHIFT (27U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN27_WIDTH (1U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN27(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN27_SHIFT)) & K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN27_MASK)

#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN28_MASK (0x10000000U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN28_SHIFT (28U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN28_WIDTH (1U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN28(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN28_SHIFT)) & K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN28_MASK)

#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN29_MASK (0x20000000U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN29_SHIFT (29U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN29_WIDTH (1U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN29(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN29_SHIFT)) & K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN29_MASK)

#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN30_MASK (0x40000000U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN30_SHIFT (30U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN30_WIDTH (1U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN30(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN30_SHIFT)) & K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN30_MASK)

#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN31_MASK (0x80000000U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN31_SHIFT (31U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN31_WIDTH (1U)
#define K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN31(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN31_SHIFT)) & K566_GPR1_GPR_RWD_42_FAULT_CH_B_EN31_MASK)
/*! @} */

/*! @name GPR_RWD_43 - Read Write DEST 43 */
/*! @{ */

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN0_MASK (0x1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN0_SHIFT (0U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN0_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN0(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN0_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN0_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN1_MASK (0x2U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN1_SHIFT (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN1_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN1(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN1_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN1_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN2_MASK (0x4U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN2_SHIFT (2U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN2_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN2(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN2_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN2_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN3_MASK (0x8U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN3_SHIFT (3U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN3_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN3(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN3_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN3_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN4_MASK (0x10U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN4_SHIFT (4U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN4_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN4(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN4_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN4_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN5_MASK (0x20U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN5_SHIFT (5U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN5_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN5(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN5_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN5_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN6_MASK (0x40U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN6_SHIFT (6U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN6_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN6(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN6_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN6_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN7_MASK (0x80U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN7_SHIFT (7U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN7_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN7(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN7_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN7_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN8_MASK (0x100U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN8_SHIFT (8U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN8_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN8(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN8_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN8_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN9_MASK (0x200U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN9_SHIFT (9U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN9_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN9(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN9_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN9_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN10_MASK (0x400U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN10_SHIFT (10U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN10_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN10(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN10_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN10_MASK)

#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN11_MASK (0x800U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN11_SHIFT (11U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN11_WIDTH (1U)
#define K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN11(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN11_SHIFT)) & K566_GPR1_GPR_RWD_43_FAULT_CH_B_EN11_MASK)

