zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE17_MASK (0x20000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE17_SHIFT (17U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE17_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE17(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE17_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE17_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE18_MASK (0x40000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE18_SHIFT (18U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE18_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE18(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE18_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE18_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE19_MASK (0x80000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE19_SHIFT (19U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE19_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE19(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE19_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE19_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE20_MASK (0x100000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE20_SHIFT (20U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE20_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE20(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE20_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE20_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE21_MASK (0x200000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE21_SHIFT (21U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE21_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE21(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE21_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE21_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE22_MASK (0x400000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE22_SHIFT (22U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE22_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE22(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE22_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE22_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE23_MASK (0x800000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE23_SHIFT (23U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE23_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE23(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE23_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE23_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE24_MASK (0x1000000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE24_SHIFT (24U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE24_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE24(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE24_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE24_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE25_MASK (0x2000000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE25_SHIFT (25U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE25_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE25(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE25_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE25_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE26_MASK (0x4000000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE26_SHIFT (26U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE26_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE26(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE26_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE26_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE27_MASK (0x8000000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE27_SHIFT (27U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE27_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE27(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE27_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE27_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE28_MASK (0x10000000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE28_SHIFT (28U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE28_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE28(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE28_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE28_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE29_MASK (0x20000000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE29_SHIFT (29U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE29_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE29(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE29_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE29_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE30_MASK (0x40000000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE30_SHIFT (30U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE30_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE30(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE30_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE30_MASK)

#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE31_MASK (0x80000000U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE31_SHIFT (31U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE31_WIDTH (1U)
#define K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE31(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE31_SHIFT)) & K566_GPR1_GPR_ROD_2_CURRENT_INJ_ACTIVE31_MASK)
/*! @} */

/*! @name GPR_ROD_3 - Read Only DEST 3 */
/*! @{ */

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE0_MASK (0x1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE0_SHIFT (0U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE0_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE0(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE0_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE0_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE1_MASK (0x2U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE1_SHIFT (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE1_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE1_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE1_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE2_MASK (0x4U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE2_SHIFT (2U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE2_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE2(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE2_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE2_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE3_MASK (0x8U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE3_SHIFT (3U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE3_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE3(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE3_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE3_MASK)

