zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE4_MASK (0x10U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE4_SHIFT (4U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE4_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE4(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE4_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE4_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE5_MASK (0x20U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE5_SHIFT (5U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE5_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE5(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE5_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE5_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE6_MASK (0x40U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE6_SHIFT (6U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE6_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE6(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE6_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE6_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE7_MASK (0x80U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE7_SHIFT (7U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE7_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE7(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE7_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE7_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE8_MASK (0x100U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE8_SHIFT (8U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE8_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE8(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE8_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE8_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE9_MASK (0x200U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE9_SHIFT (9U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE9_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE9(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE9_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE9_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE10_MASK (0x400U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE10_SHIFT (10U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE10_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE10(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE10_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE10_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE11_MASK (0x800U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE11_SHIFT (11U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE11_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE11(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE11_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE11_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE12_MASK (0x1000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE12_SHIFT (12U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE12_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE12(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE12_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE12_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE13_MASK (0x2000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE13_SHIFT (13U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE13_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE13(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE13_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE13_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE14_MASK (0x4000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE14_SHIFT (14U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE14_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE14(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE14_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE14_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE15_MASK (0x8000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE15_SHIFT (15U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE15_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE15(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE15_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE15_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE16_MASK (0x10000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE16_SHIFT (16U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE16_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE16(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE16_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE16_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE17_MASK (0x20000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE17_SHIFT (17U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE17_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE17(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE17_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE17_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE18_MASK (0x40000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE18_SHIFT (18U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE18_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE18(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE18_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE18_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE19_MASK (0x80000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE19_SHIFT (19U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE19_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE19(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE19_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE19_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE20_MASK (0x100000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE20_SHIFT (20U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE20_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE20(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE20_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE20_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE21_MASK (0x200000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE21_SHIFT (21U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE21_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE21(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE21_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE21_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE22_MASK (0x400000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE22_SHIFT (22U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE22_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE22(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE22_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE22_MASK)

#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE23_MASK (0x800000U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE23_SHIFT (23U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE23_WIDTH (1U)
#define K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE23(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE23_SHIFT)) & K566_GPR1_GPR_ROD_3_CURRENT_INJ_ACTIVE23_MASK)

