zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE16_MASK (0x10000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE16_SHIFT (16U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE16_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE16(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE16_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE16_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE17_MASK (0x20000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE17_SHIFT (17U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE17_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE17(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE17_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE17_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE18_MASK (0x40000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE18_SHIFT (18U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE18_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE18(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE18_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE18_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE19_MASK (0x80000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE19_SHIFT (19U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE19_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE19(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE19_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE19_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE20_MASK (0x100000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE20_SHIFT (20U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE20_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE20(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE20_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE20_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE21_MASK (0x200000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE21_SHIFT (21U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE21_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE21(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE21_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE21_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE22_MASK (0x400000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE22_SHIFT (22U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE22_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE22(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE22_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_ACTIVE22_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE23_MASK (0x800000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE23_SHIFT (23U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE23_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE23(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE23_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE23_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE24_MASK (0x1000000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE24_SHIFT (24U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE24_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE24(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE24_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE24_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE25_MASK (0x2000000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE25_SHIFT (25U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE25_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE25(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE25_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE25_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE26_MASK (0x4000000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE26_SHIFT (26U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE26_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE26(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE26_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE26_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE27_MASK (0x8000000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE27_SHIFT (27U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE27_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE27(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE27_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE27_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE28_MASK (0x10000000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE28_SHIFT (28U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE28_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE28(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE28_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE28_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE29_MASK (0x20000000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE29_SHIFT (29U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE29_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE29(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE29_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE29_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE30_MASK (0x40000000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE30_SHIFT (30U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE30_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE30(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE30_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE30_MASK)

#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE31_MASK (0x80000000U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE31_SHIFT (31U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE31_WIDTH (1U)
#define K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE31(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE31_SHIFT)) & K566_GPR1_GPR_ROD_4_CURRENT_INJ_COMPLETE31_MASK)
/*! @} */

