zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
/*! @name GPR_ROD_5 - Read Only DEST 5 */
/*! @{ */

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE0_MASK (0x1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE0_SHIFT (0U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE0_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE0(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE0_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE0_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE1_MASK (0x2U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE1_SHIFT (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE1_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE1_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE1_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE2_MASK (0x4U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE2_SHIFT (2U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE2_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE2(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE2_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE2_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE3_MASK (0x8U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE3_SHIFT (3U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE3_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE3(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE3_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE3_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE4_MASK (0x10U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE4_SHIFT (4U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE4_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE4(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE4_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE4_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE5_MASK (0x20U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE5_SHIFT (5U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE5_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE5(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE5_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE5_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE6_MASK (0x40U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE6_SHIFT (6U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE6_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE6(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE6_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE6_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE7_MASK (0x80U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE7_SHIFT (7U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE7_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE7(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE7_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE7_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE8_MASK (0x100U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE8_SHIFT (8U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE8_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE8(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE8_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE8_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE9_MASK (0x200U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE9_SHIFT (9U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE9_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE9(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE9_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE9_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE10_MASK (0x400U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE10_SHIFT (10U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE10_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE10(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE10_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE10_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE11_MASK (0x800U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE11_SHIFT (11U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE11_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE11(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE11_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE11_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE12_MASK (0x1000U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE12_SHIFT (12U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE12_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE12(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE12_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE12_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE13_MASK (0x2000U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE13_SHIFT (13U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE13_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE13(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE13_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE13_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE14_MASK (0x4000U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE14_SHIFT (14U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE14_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE14(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE14_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE14_MASK)

#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE15_MASK (0x8000U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE15_SHIFT (15U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE15_WIDTH (1U)
#define K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE15(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE15_SHIFT)) & K566_GPR1_GPR_ROD_5_CURRENT_INJ_COMPLETE15_MASK)

