zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE7_MASK (0x80U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE7_SHIFT (7U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE7_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE7(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE7_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE7_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE8_MASK (0x100U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE8_SHIFT (8U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE8_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE8(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE8_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE8_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE9_MASK (0x200U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE9_SHIFT (9U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE9_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE9(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE9_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE9_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE10_MASK (0x400U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE10_SHIFT (10U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE10_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE10(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE10_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE10_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE11_MASK (0x800U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE11_SHIFT (11U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE11_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE11(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE11_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE11_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE12_MASK (0x1000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE12_SHIFT (12U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE12_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE12(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE12_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE12_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE13_MASK (0x2000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE13_SHIFT (13U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE13_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE13(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE13_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE13_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE14_MASK (0x4000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE14_SHIFT (14U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE14_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE14(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE14_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE14_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE15_MASK (0x8000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE15_SHIFT (15U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE15_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE15(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE15_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE15_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE16_MASK (0x10000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE16_SHIFT (16U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE16_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE16(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE16_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE16_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE17_MASK (0x20000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE17_SHIFT (17U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE17_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE17(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE17_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE17_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE18_MASK (0x40000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE18_SHIFT (18U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE18_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE18(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE18_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE18_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE19_MASK (0x80000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE19_SHIFT (19U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE19_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE19(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE19_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE19_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE20_MASK (0x100000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE20_SHIFT (20U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE20_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE20(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE20_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE20_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE21_MASK (0x200000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE21_SHIFT (21U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE21_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE21(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE21_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE21_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE22_MASK (0x400000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE22_SHIFT (22U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE22_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE22(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE22_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE22_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE23_MASK (0x800000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE23_SHIFT (23U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE23_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE23(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE23_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE23_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE24_MASK (0x1000000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE24_SHIFT (24U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE24_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE24(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE24_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE24_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE25_MASK (0x2000000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE25_SHIFT (25U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE25_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE25(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE25_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE25_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE26_MASK (0x4000000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE26_SHIFT (26U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE26_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE26(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE26_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE26_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE27_MASK (0x8000000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE27_SHIFT (27U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE27_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE27(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE27_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE27_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE28_MASK (0x10000000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE28_SHIFT (28U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE28_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE28(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE28_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE28_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE29_MASK (0x20000000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE29_SHIFT (29U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE29_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE29(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE29_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE29_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE30_MASK (0x40000000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE30_SHIFT (30U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE30_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE30(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE30_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE30_MASK)

#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE31_MASK (0x80000000U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE31_SHIFT (31U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE31_WIDTH (1U)
#define K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE31(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE31_SHIFT)) & K566_GPR1_GPR_ROD_7_CURRENT_INJ_COMPLETE31_MASK)
/*! @} */

