zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE21_MASK (0x200000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE21_SHIFT (21U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE21_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE21(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE21_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE21_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE22_MASK (0x400000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE22_SHIFT (22U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE22_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE22(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE22_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE22_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE23_MASK (0x800000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE23_SHIFT (23U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE23_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE23(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE23_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE23_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE24_MASK (0x1000000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE24_SHIFT (24U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE24_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE24(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE24_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE24_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE25_MASK (0x2000000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE25_SHIFT (25U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE25_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE25(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE25_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE25_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE26_MASK (0x4000000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE26_SHIFT (26U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE26_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE26(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE26_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE26_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE27_MASK (0x8000000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE27_SHIFT (27U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE27_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE27(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE27_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE27_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE28_MASK (0x10000000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE28_SHIFT (28U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE28_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE28(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE28_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE28_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE29_MASK (0x20000000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE29_SHIFT (29U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE29_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE29(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE29_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE29_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE30_MASK (0x40000000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE30_SHIFT (30U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE30_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE30(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE30_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE30_MASK)

#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE31_MASK (0x80000000U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE31_SHIFT (31U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE31_WIDTH (1U)
#define K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE31(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE31_SHIFT)) & K566_GPR1_GPR_ROD_8_CURRENT_INJ_COMPLETE31_MASK)
/*! @} */

/*! @name GPR_ROD_9 - Read Only DEST 9 */
/*! @{ */

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE0_MASK (0x1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE0_SHIFT (0U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE0_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE0(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE0_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE0_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE1_MASK (0x2U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE1_SHIFT (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE1_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE1(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE1_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE1_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE2_MASK (0x4U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE2_SHIFT (2U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE2_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE2(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE2_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE2_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE3_MASK (0x8U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE3_SHIFT (3U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE3_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE3(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE3_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE3_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE4_MASK (0x10U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE4_SHIFT (4U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE4_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE4(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE4_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE4_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE5_MASK (0x20U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE5_SHIFT (5U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE5_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE5(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE5_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE5_MASK)

