zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE6_MASK (0x40U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE6_SHIFT (6U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE6_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE6(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE6_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE6_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE7_MASK (0x80U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE7_SHIFT (7U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE7_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE7(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE7_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE7_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE8_MASK (0x100U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE8_SHIFT (8U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE8_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE8(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE8_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE8_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE9_MASK (0x200U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE9_SHIFT (9U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE9_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE9(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE9_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE9_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE10_MASK (0x400U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE10_SHIFT (10U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE10_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE10(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE10_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE10_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE11_MASK (0x800U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE11_SHIFT (11U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE11_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE11(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE11_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE11_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE12_MASK (0x1000U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE12_SHIFT (12U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE12_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE12(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE12_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE12_MASK)

#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE13_MASK (0x2000U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE13_SHIFT (13U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE13_WIDTH (1U)
#define K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE13(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE13_SHIFT)) & K566_GPR1_GPR_ROD_9_CURRENT_INJ_COMPLETE13_MASK)
/*! @} */

/*! @name GPR_RWF_0 - Read Write FUNC 0 */
/*! @{ */

#define K566_GPR1_GPR_RWF_0_AXI_ACC_PORT_FD_REQ_MASK (0x1U)
#define K566_GPR1_GPR_RWF_0_AXI_ACC_PORT_FD_REQ_SHIFT (0U)
#define K566_GPR1_GPR_RWF_0_AXI_ACC_PORT_FD_REQ_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_AXI_ACC_PORT_FD_REQ(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_AXI_ACC_PORT_FD_REQ_SHIFT)) & K566_GPR1_GPR_RWF_0_AXI_ACC_PORT_FD_REQ_MASK)

#define K566_GPR1_GPR_RWF_0_CORE0_FD_REQ_MASK    (0x2U)
#define K566_GPR1_GPR_RWF_0_CORE0_FD_REQ_SHIFT   (1U)
#define K566_GPR1_GPR_RWF_0_CORE0_FD_REQ_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_0_CORE0_FD_REQ(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_CORE0_FD_REQ_SHIFT)) & K566_GPR1_GPR_RWF_0_CORE0_FD_REQ_MASK)

#define K566_GPR1_GPR_RWF_0_CORE1_FD_REQ_MASK    (0x4U)
#define K566_GPR1_GPR_RWF_0_CORE1_FD_REQ_SHIFT   (2U)
#define K566_GPR1_GPR_RWF_0_CORE1_FD_REQ_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_0_CORE1_FD_REQ(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_CORE1_FD_REQ_SHIFT)) & K566_GPR1_GPR_RWF_0_CORE1_FD_REQ_MASK)

#define K566_GPR1_GPR_RWF_0_CORE2_FD_REQ_MASK    (0x8U)
#define K566_GPR1_GPR_RWF_0_CORE2_FD_REQ_SHIFT   (3U)
#define K566_GPR1_GPR_RWF_0_CORE2_FD_REQ_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_0_CORE2_FD_REQ(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_CORE2_FD_REQ_SHIFT)) & K566_GPR1_GPR_RWF_0_CORE2_FD_REQ_MASK)

#define K566_GPR1_GPR_RWF_0_CORE3_FD_REQ_MASK    (0x10U)
#define K566_GPR1_GPR_RWF_0_CORE3_FD_REQ_SHIFT   (4U)
#define K566_GPR1_GPR_RWF_0_CORE3_FD_REQ_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_0_CORE3_FD_REQ(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_CORE3_FD_REQ_SHIFT)) & K566_GPR1_GPR_RWF_0_CORE3_FD_REQ_MASK)

#define K566_GPR1_GPR_RWF_0_ETR_FD_REQ_MASK      (0x20U)
#define K566_GPR1_GPR_RWF_0_ETR_FD_REQ_SHIFT     (5U)
#define K566_GPR1_GPR_RWF_0_ETR_FD_REQ_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_0_ETR_FD_REQ(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_ETR_FD_REQ_SHIFT)) & K566_GPR1_GPR_RWF_0_ETR_FD_REQ_MASK)

#define K566_GPR1_GPR_RWF_0_NUM_ZONE_MASK        (0xE00U)
#define K566_GPR1_GPR_RWF_0_NUM_ZONE_SHIFT       (9U)
#define K566_GPR1_GPR_RWF_0_NUM_ZONE_WIDTH       (3U)
#define K566_GPR1_GPR_RWF_0_NUM_ZONE(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_NUM_ZONE_SHIFT)) & K566_GPR1_GPR_RWF_0_NUM_ZONE_MASK)

#define K566_GPR1_GPR_RWF_0_TCM_XBAR_FAULT_ACK12_MASK (0x1000U)
#define K566_GPR1_GPR_RWF_0_TCM_XBAR_FAULT_ACK12_SHIFT (12U)
#define K566_GPR1_GPR_RWF_0_TCM_XBAR_FAULT_ACK12_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_TCM_XBAR_FAULT_ACK12(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_TCM_XBAR_FAULT_ACK12_SHIFT)) & K566_GPR1_GPR_RWF_0_TCM_XBAR_FAULT_ACK12_MASK)

#define K566_GPR1_GPR_RWF_0_AXBS_XBAR_FAULT_ACK13_MASK (0x2000U)
#define K566_GPR1_GPR_RWF_0_AXBS_XBAR_FAULT_ACK13_SHIFT (13U)
#define K566_GPR1_GPR_RWF_0_AXBS_XBAR_FAULT_ACK13_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_AXBS_XBAR_FAULT_ACK13(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_AXBS_XBAR_FAULT_ACK13_SHIFT)) & K566_GPR1_GPR_RWF_0_AXBS_XBAR_FAULT_ACK13_MASK)

#define K566_GPR1_GPR_RWF_0_PERIPH_XBAR_FAULT_ACK14_MASK (0x4000U)
#define K566_GPR1_GPR_RWF_0_PERIPH_XBAR_FAULT_ACK14_SHIFT (14U)
#define K566_GPR1_GPR_RWF_0_PERIPH_XBAR_FAULT_ACK14_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_PERIPH_XBAR_FAULT_ACK14(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_PERIPH_XBAR_FAULT_ACK14_SHIFT)) & K566_GPR1_GPR_RWF_0_PERIPH_XBAR_FAULT_ACK14_MASK)

#define K566_GPR1_GPR_RWF_0_ADC_CH18_MASK        (0x40000U)
#define K566_GPR1_GPR_RWF_0_ADC_CH18_SHIFT       (18U)
#define K566_GPR1_GPR_RWF_0_ADC_CH18_WIDTH       (1U)
#define K566_GPR1_GPR_RWF_0_ADC_CH18(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_ADC_CH18_SHIFT)) & K566_GPR1_GPR_RWF_0_ADC_CH18_MASK)

#define K566_GPR1_GPR_RWF_0_ADC_CH19_MASK        (0x80000U)
#define K566_GPR1_GPR_RWF_0_ADC_CH19_SHIFT       (19U)
#define K566_GPR1_GPR_RWF_0_ADC_CH19_WIDTH       (1U)
#define K566_GPR1_GPR_RWF_0_ADC_CH19(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_ADC_CH19_SHIFT)) & K566_GPR1_GPR_RWF_0_ADC_CH19_MASK)

#define K566_GPR1_GPR_RWF_0_ADC_CH20_MASK        (0x100000U)
#define K566_GPR1_GPR_RWF_0_ADC_CH20_SHIFT       (20U)
#define K566_GPR1_GPR_RWF_0_ADC_CH20_WIDTH       (1U)
#define K566_GPR1_GPR_RWF_0_ADC_CH20(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_ADC_CH20_SHIFT)) & K566_GPR1_GPR_RWF_0_ADC_CH20_MASK)

