zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWF_0_ADC_CH21_MASK        (0x200000U)
#define K566_GPR1_GPR_RWF_0_ADC_CH21_SHIFT       (21U)
#define K566_GPR1_GPR_RWF_0_ADC_CH21_WIDTH       (1U)
#define K566_GPR1_GPR_RWF_0_ADC_CH21(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_ADC_CH21_SHIFT)) & K566_GPR1_GPR_RWF_0_ADC_CH21_MASK)

#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN0_MASK  (0x400000U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN0_SHIFT (22U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN0_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN0(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_SAFE_STATE_EN0_SHIFT)) & K566_GPR1_GPR_RWF_0_SAFE_STATE_EN0_MASK)

#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN1_MASK  (0x800000U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN1_SHIFT (23U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN1_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN1(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_SAFE_STATE_EN1_SHIFT)) & K566_GPR1_GPR_RWF_0_SAFE_STATE_EN1_MASK)

#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN2_MASK  (0x1000000U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN2_SHIFT (24U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN2_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN2(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_SAFE_STATE_EN2_SHIFT)) & K566_GPR1_GPR_RWF_0_SAFE_STATE_EN2_MASK)

#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN3_MASK  (0x2000000U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN3_SHIFT (25U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN3_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_SAFE_STATE_EN3(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_SAFE_STATE_EN3_SHIFT)) & K566_GPR1_GPR_RWF_0_SAFE_STATE_EN3_MASK)

#define K566_GPR1_GPR_RWF_0_NEUTRON_CLK_UNGATE_MASK (0x4000000U)
#define K566_GPR1_GPR_RWF_0_NEUTRON_CLK_UNGATE_SHIFT (26U)
#define K566_GPR1_GPR_RWF_0_NEUTRON_CLK_UNGATE_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_NEUTRON_CLK_UNGATE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_NEUTRON_CLK_UNGATE_SHIFT)) & K566_GPR1_GPR_RWF_0_NEUTRON_CLK_UNGATE_MASK)

#define K566_GPR1_GPR_RWF_0_CORE0_TCM_BLOCK_MASK (0x8000000U)
#define K566_GPR1_GPR_RWF_0_CORE0_TCM_BLOCK_SHIFT (27U)
#define K566_GPR1_GPR_RWF_0_CORE0_TCM_BLOCK_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_CORE0_TCM_BLOCK(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_CORE0_TCM_BLOCK_SHIFT)) & K566_GPR1_GPR_RWF_0_CORE0_TCM_BLOCK_MASK)

#define K566_GPR1_GPR_RWF_0_CORE1_TCM_BLOCK_MASK (0x10000000U)
#define K566_GPR1_GPR_RWF_0_CORE1_TCM_BLOCK_SHIFT (28U)
#define K566_GPR1_GPR_RWF_0_CORE1_TCM_BLOCK_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_CORE1_TCM_BLOCK(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_CORE1_TCM_BLOCK_SHIFT)) & K566_GPR1_GPR_RWF_0_CORE1_TCM_BLOCK_MASK)

#define K566_GPR1_GPR_RWF_0_CORE2_TCM_BLOCK_MASK (0x20000000U)
#define K566_GPR1_GPR_RWF_0_CORE2_TCM_BLOCK_SHIFT (29U)
#define K566_GPR1_GPR_RWF_0_CORE2_TCM_BLOCK_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_CORE2_TCM_BLOCK(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_CORE2_TCM_BLOCK_SHIFT)) & K566_GPR1_GPR_RWF_0_CORE2_TCM_BLOCK_MASK)

#define K566_GPR1_GPR_RWF_0_CORE3_TCM_BLOCK_MASK (0x40000000U)
#define K566_GPR1_GPR_RWF_0_CORE3_TCM_BLOCK_SHIFT (30U)
#define K566_GPR1_GPR_RWF_0_CORE3_TCM_BLOCK_WIDTH (1U)
#define K566_GPR1_GPR_RWF_0_CORE3_TCM_BLOCK(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_0_CORE3_TCM_BLOCK_SHIFT)) & K566_GPR1_GPR_RWF_0_CORE3_TCM_BLOCK_MASK)
/*! @} */

/*! @name GPR_RWF_1 - Read Write FUNC 1 */
/*! @{ */

#define K566_GPR1_GPR_RWF_1_NPU_DISABLE_MASK     (0x4000U)
#define K566_GPR1_GPR_RWF_1_NPU_DISABLE_SHIFT    (14U)
#define K566_GPR1_GPR_RWF_1_NPU_DISABLE_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_1_NPU_DISABLE(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_NPU_DISABLE_SHIFT)) & K566_GPR1_GPR_RWF_1_NPU_DISABLE_MASK)

#define K566_GPR1_GPR_RWF_1_CURR_INJ_CLEAR_MASK  (0x8000U)
#define K566_GPR1_GPR_RWF_1_CURR_INJ_CLEAR_SHIFT (15U)
#define K566_GPR1_GPR_RWF_1_CURR_INJ_CLEAR_WIDTH (1U)
#define K566_GPR1_GPR_RWF_1_CURR_INJ_CLEAR(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_CURR_INJ_CLEAR_SHIFT)) & K566_GPR1_GPR_RWF_1_CURR_INJ_CLEAR_MASK)

#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN0_MASK   (0x200000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN0_SHIFT  (21U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN0_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN0(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN0_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN0_MASK)

#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN1_MASK   (0x400000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN1_SHIFT  (22U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN1_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN1(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN1_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN1_MASK)

#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN2_MASK   (0x800000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN2_SHIFT  (23U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN2_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN2(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN2_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN2_MASK)

#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN3_MASK   (0x1000000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN3_SHIFT  (24U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN3_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN3(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN3_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN3_MASK)

#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN4_MASK   (0x2000000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN4_SHIFT  (25U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN4_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN4(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN4_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN4_MASK)

#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN5_MASK   (0x4000000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN5_SHIFT  (26U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN5_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN5(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN5_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN5_MASK)

