zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN6_MASK   (0x8000000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN6_SHIFT  (27U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN6_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN6(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN6_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN6_MASK)

#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN7_MASK   (0x10000000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN7_SHIFT  (28U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN7_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN7(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN7_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN7_MASK)

#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN8_MASK   (0x20000000U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN8_SHIFT  (29U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN8_WIDTH  (1U)
#define K566_GPR1_GPR_RWF_1_TIME_BASE_EN8(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_1_TIME_BASE_EN8_SHIFT)) & K566_GPR1_GPR_RWF_1_TIME_BASE_EN8_MASK)
/*! @} */

/*! @name GPR_RWF_2 - Read Write FUNC 2 */
/*! @{ */

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL0_MASK     (0x1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL0_SHIFT    (0U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL0_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL0(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL0_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL0_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL1_MASK     (0x2U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL1_SHIFT    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL1_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL1(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL1_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL1_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL2_MASK     (0x4U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL2_SHIFT    (2U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL2_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL2(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL2_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL2_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL3_MASK     (0x8U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL3_SHIFT    (3U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL3_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL3(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL3_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL3_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL4_MASK     (0x10U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL4_SHIFT    (4U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL4_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL4(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL4_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL4_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL5_MASK     (0x20U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL5_SHIFT    (5U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL5_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL5(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL5_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL5_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL6_MASK     (0x40U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL6_SHIFT    (6U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL6_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL6(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL6_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL6_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL7_MASK     (0x80U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL7_SHIFT    (7U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL7_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL7(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL7_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL7_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL8_MASK     (0x100U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL8_SHIFT    (8U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL8_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL8(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL8_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL8_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL9_MASK     (0x200U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL9_SHIFT    (9U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL9_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL9(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL9_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL9_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL10_MASK    (0x400U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL10_SHIFT   (10U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL10_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL10(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL10_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL10_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL11_MASK    (0x800U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL11_SHIFT   (11U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL11_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL11(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL11_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL11_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL12_MASK    (0x1000U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL12_SHIFT   (12U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL12_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL12(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL12_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL12_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL13_MASK    (0x2000U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL13_SHIFT   (13U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL13_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL13(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL13_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL13_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL14_MASK    (0x4000U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL14_SHIFT   (14U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL14_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL14(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL14_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL14_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL15_MASK    (0x8000U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL15_SHIFT   (15U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL15_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL15(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL15_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL15_MASK)

#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL16_MASK    (0x10000U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL16_SHIFT   (16U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL16_WIDTH   (1U)
#define K566_GPR1_GPR_RWF_2_CAN_TS_SEL16(x)      (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_2_CAN_TS_SEL16_SHIFT)) & K566_GPR1_GPR_RWF_2_CAN_TS_SEL16_MASK)
/*! @} */

/*! @name GPR_RWF_4 - Read Write FUNC 4 */
/*! @{ */

#define K566_GPR1_GPR_RWF_4_LPE_RW_BLOCK_EN_MASK (0x1U)
#define K566_GPR1_GPR_RWF_4_LPE_RW_BLOCK_EN_SHIFT (0U)
#define K566_GPR1_GPR_RWF_4_LPE_RW_BLOCK_EN_WIDTH (1U)
#define K566_GPR1_GPR_RWF_4_LPE_RW_BLOCK_EN(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_4_LPE_RW_BLOCK_EN_SHIFT)) & K566_GPR1_GPR_RWF_4_LPE_RW_BLOCK_EN_MASK)

#define K566_GPR1_GPR_RWF_4_LOCK_EN0_MASK        (0x40000000U)
#define K566_GPR1_GPR_RWF_4_LOCK_EN0_SHIFT       (30U)
#define K566_GPR1_GPR_RWF_4_LOCK_EN0_WIDTH       (1U)
#define K566_GPR1_GPR_RWF_4_LOCK_EN0(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_4_LOCK_EN0_SHIFT)) & K566_GPR1_GPR_RWF_4_LOCK_EN0_MASK)

