zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWF_4_LOCK_EN1_MASK        (0x80000000U)
#define K566_GPR1_GPR_RWF_4_LOCK_EN1_SHIFT       (31U)
#define K566_GPR1_GPR_RWF_4_LOCK_EN1_WIDTH       (1U)
#define K566_GPR1_GPR_RWF_4_LOCK_EN1(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_4_LOCK_EN1_SHIFT)) & K566_GPR1_GPR_RWF_4_LOCK_EN1_MASK)
/*! @} */

/*! @name GPR_RWF_5 - Read Write FUNC 5 */
/*! @{ */

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN0_MASK      (0x1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN0_SHIFT     (0U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN0_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN0(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN0_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN0_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN1_MASK      (0x2U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN1_SHIFT     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN1_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN1(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN1_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN1_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN2_MASK      (0x4U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN2_SHIFT     (2U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN2_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN2(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN2_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN2_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN3_MASK      (0x8U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN3_SHIFT     (3U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN3_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN3(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN3_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN3_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN4_MASK      (0x10U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN4_SHIFT     (4U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN4_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN4(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN4_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN4_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN5_MASK      (0x20U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN5_SHIFT     (5U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN5_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN5(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN5_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN5_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN6_MASK      (0x40U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN6_SHIFT     (6U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN6_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN6(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN6_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN6_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN7_MASK      (0x80U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN7_SHIFT     (7U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN7_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN7(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN7_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN7_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN8_MASK      (0x100U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN8_SHIFT     (8U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN8_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN8(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN8_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN8_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN9_MASK      (0x200U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN9_SHIFT     (9U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN9_WIDTH     (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN9(x)        (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN9_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN9_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN10_MASK     (0x400U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN10_SHIFT    (10U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN10_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN10(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN10_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN10_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN11_MASK     (0x800U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN11_SHIFT    (11U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN11_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN11(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN11_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN11_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN12_MASK     (0x1000U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN12_SHIFT    (12U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN12_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN12(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN12_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN12_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN13_MASK     (0x2000U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN13_SHIFT    (13U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN13_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN13(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN13_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN13_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN14_MASK     (0x4000U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN14_SHIFT    (14U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN14_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN14(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN14_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN14_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN15_MASK     (0x8000U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN15_SHIFT    (15U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN15_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN15(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN15_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN15_MASK)

#define K566_GPR1_GPR_RWF_5_CAN_TS_EN16_MASK     (0x10000U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN16_SHIFT    (16U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN16_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_5_CAN_TS_EN16(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_CAN_TS_EN16_SHIFT)) & K566_GPR1_GPR_RWF_5_CAN_TS_EN16_MASK)

#define K566_GPR1_GPR_RWF_5_RTU_DEBUG_CLK_GATING_EN_MASK (0x20000000U)
#define K566_GPR1_GPR_RWF_5_RTU_DEBUG_CLK_GATING_EN_SHIFT (29U)
#define K566_GPR1_GPR_RWF_5_RTU_DEBUG_CLK_GATING_EN_WIDTH (1U)
#define K566_GPR1_GPR_RWF_5_RTU_DEBUG_CLK_GATING_EN(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_5_RTU_DEBUG_CLK_GATING_EN_SHIFT)) & K566_GPR1_GPR_RWF_5_RTU_DEBUG_CLK_GATING_EN_MASK)
/*! @} */

/*! @name GPR_RWF_6 - Read Write FUNC 6 */
/*! @{ */

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_7_MASK (0x80U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_7_SHIFT (7U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_7_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_7(x)   (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_7_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_7_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_18_MASK (0x40000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_18_SHIFT (18U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_18_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_18(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_18_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_18_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_19_MASK (0x80000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_19_SHIFT (19U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_19_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_19(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_19_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_19_MASK)

