zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_20_MASK (0x100000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_20_SHIFT (20U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_20_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_20(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_20_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_20_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_21_MASK (0x200000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_21_SHIFT (21U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_21_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_21(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_21_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_21_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_22_MASK (0x400000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_22_SHIFT (22U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_22_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_22(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_22_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_22_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_23_MASK (0x800000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_23_SHIFT (23U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_23_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_23(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_23_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_23_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_27_MASK (0x8000000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_27_SHIFT (27U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_27_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_27(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_27_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_27_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_28_MASK (0x10000000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_28_SHIFT (28U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_28_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_28(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_28_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_28_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_29_MASK (0x20000000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_29_SHIFT (29U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_29_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_29(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_29_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_29_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_30_MASK (0x40000000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_30_SHIFT (30U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_30_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_30(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_30_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_30_MASK)

#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_31_MASK (0x80000000U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_31_SHIFT (31U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_31_WIDTH (1U)
#define K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_31(x)  (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_31_SHIFT)) & K566_GPR1_GPR_RWF_6_APP_HSE2_COMM_31_MASK)
/*! @} */

/*! @name GPR_RWF_7 - Read Write FUNC 7 */
/*! @{ */

#define K566_GPR1_GPR_RWF_7_PB3_CREF_EN_MASK     (0x1U)
#define K566_GPR1_GPR_RWF_7_PB3_CREF_EN_SHIFT    (0U)
#define K566_GPR1_GPR_RWF_7_PB3_CREF_EN_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_7_PB3_CREF_EN(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_7_PB3_CREF_EN_SHIFT)) & K566_GPR1_GPR_RWF_7_PB3_CREF_EN_MASK)

#define K566_GPR1_GPR_RWF_7_PB0_CREF_EN_MASK     (0x2U)
#define K566_GPR1_GPR_RWF_7_PB0_CREF_EN_SHIFT    (1U)
#define K566_GPR1_GPR_RWF_7_PB0_CREF_EN_WIDTH    (1U)
#define K566_GPR1_GPR_RWF_7_PB0_CREF_EN(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_7_PB0_CREF_EN_SHIFT)) & K566_GPR1_GPR_RWF_7_PB0_CREF_EN_MASK)

#define K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_OUT_MASK (0x4U)
#define K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_OUT_SHIFT (2U)
#define K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_OUT_WIDTH (1U)
#define K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_OUT(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_OUT_SHIFT)) & K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_OUT_MASK)

#define K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_IN_MASK (0x8U)
#define K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_IN_SHIFT (3U)
#define K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_IN_WIDTH (1U)
#define K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_IN(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_IN_SHIFT)) & K566_GPR1_GPR_RWF_7_LOOPBACK_MUX_SEL_IN_MASK)

#define K566_GPR1_GPR_RWF_7_IBE_SDHC_LOOPBACK_MASK (0x10U)
#define K566_GPR1_GPR_RWF_7_IBE_SDHC_LOOPBACK_SHIFT (4U)
#define K566_GPR1_GPR_RWF_7_IBE_SDHC_LOOPBACK_WIDTH (1U)
#define K566_GPR1_GPR_RWF_7_IBE_SDHC_LOOPBACK(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_7_IBE_SDHC_LOOPBACK_SHIFT)) & K566_GPR1_GPR_RWF_7_IBE_SDHC_LOOPBACK_MASK)

#define K566_GPR1_GPR_RWF_7_OBE_SDHC_LOOPBACK_MASK (0x20U)
#define K566_GPR1_GPR_RWF_7_OBE_SDHC_LOOPBACK_SHIFT (5U)
#define K566_GPR1_GPR_RWF_7_OBE_SDHC_LOOPBACK_WIDTH (1U)
#define K566_GPR1_GPR_RWF_7_OBE_SDHC_LOOPBACK(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_RWF_7_OBE_SDHC_LOOPBACK_SHIFT)) & K566_GPR1_GPR_RWF_7_OBE_SDHC_LOOPBACK_MASK)
/*! @} */

/*! @name GPR_ROF_0 - Read Only FUNC 0 */
/*! @{ */

#define K566_GPR1_GPR_ROF_0_AXI_ACC_PORT_FD_IDLE_MASK (0x10U)
#define K566_GPR1_GPR_ROF_0_AXI_ACC_PORT_FD_IDLE_SHIFT (4U)
#define K566_GPR1_GPR_ROF_0_AXI_ACC_PORT_FD_IDLE_WIDTH (1U)
#define K566_GPR1_GPR_ROF_0_AXI_ACC_PORT_FD_IDLE(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AXI_ACC_PORT_FD_IDLE_SHIFT)) & K566_GPR1_GPR_ROF_0_AXI_ACC_PORT_FD_IDLE_MASK)

#define K566_GPR1_GPR_ROF_0_CORE0_FD_IDLE_MASK   (0x20U)
#define K566_GPR1_GPR_ROF_0_CORE0_FD_IDLE_SHIFT  (5U)
#define K566_GPR1_GPR_ROF_0_CORE0_FD_IDLE_WIDTH  (1U)
#define K566_GPR1_GPR_ROF_0_CORE0_FD_IDLE(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_CORE0_FD_IDLE_SHIFT)) & K566_GPR1_GPR_ROF_0_CORE0_FD_IDLE_MASK)

#define K566_GPR1_GPR_ROF_0_CORE1_FD_IDLE_MASK   (0x40U)
#define K566_GPR1_GPR_ROF_0_CORE1_FD_IDLE_SHIFT  (6U)
#define K566_GPR1_GPR_ROF_0_CORE1_FD_IDLE_WIDTH  (1U)
#define K566_GPR1_GPR_ROF_0_CORE1_FD_IDLE(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_CORE1_FD_IDLE_SHIFT)) & K566_GPR1_GPR_ROF_0_CORE1_FD_IDLE_MASK)

#define K566_GPR1_GPR_ROF_0_CORE2_FD_IDLE_MASK   (0x80U)
#define K566_GPR1_GPR_ROF_0_CORE2_FD_IDLE_SHIFT  (7U)
#define K566_GPR1_GPR_ROF_0_CORE2_FD_IDLE_WIDTH  (1U)
#define K566_GPR1_GPR_ROF_0_CORE2_FD_IDLE(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_CORE2_FD_IDLE_SHIFT)) & K566_GPR1_GPR_ROF_0_CORE2_FD_IDLE_MASK)

#define K566_GPR1_GPR_ROF_0_CORE3_FD_IDLE_MASK   (0x100U)
#define K566_GPR1_GPR_ROF_0_CORE3_FD_IDLE_SHIFT  (8U)
#define K566_GPR1_GPR_ROF_0_CORE3_FD_IDLE_WIDTH  (1U)
#define K566_GPR1_GPR_ROF_0_CORE3_FD_IDLE(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_CORE3_FD_IDLE_SHIFT)) & K566_GPR1_GPR_ROF_0_CORE3_FD_IDLE_MASK)

#define K566_GPR1_GPR_ROF_0_ETR_FD_IDLE_MASK     (0x200U)
#define K566_GPR1_GPR_ROF_0_ETR_FD_IDLE_SHIFT    (9U)
#define K566_GPR1_GPR_ROF_0_ETR_FD_IDLE_WIDTH    (1U)
#define K566_GPR1_GPR_ROF_0_ETR_FD_IDLE(x)       (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_ETR_FD_IDLE_SHIFT)) & K566_GPR1_GPR_ROF_0_ETR_FD_IDLE_MASK)

#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_PRIV_MASK (0x2000U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_PRIV_SHIFT (13U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_PRIV_WIDTH (1U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_PRIV(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_PRIV_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_PRIV_MASK)

#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_NS_MASK (0x4000U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_NS_SHIFT (14U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_NS_WIDTH (1U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_NS(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_NS_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_NS_MASK)

#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_DID_MASK (0x78000U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_DID_SHIFT (15U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_DID_WIDTH (4U)
#define K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_DID(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_DID_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_SAFETY_ERR_DID_MASK)

#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_PRIV_MASK (0x80000U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_PRIV_SHIFT (19U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_PRIV_WIDTH (1U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_PRIV(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_PRIV_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_PRIV_MASK)

