zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_GPR1.h
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_NS_MASK (0x100000U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_NS_SHIFT (20U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_NS_WIDTH (1U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_NS(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_NS_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_NS_MASK)

#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_DID_MASK (0x1E00000U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_DID_SHIFT (21U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_DID_WIDTH (4U)
#define K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_DID(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_DID_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_FEED_DID_ERR_DID_MASK)

#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_PRIV_MASK (0x2000000U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_PRIV_SHIFT (25U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_PRIV_WIDTH (1U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_PRIV(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_PRIV_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_PRIV_MASK)

#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_NS_MASK (0x4000000U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_NS_SHIFT (26U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_NS_WIDTH (1U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_NS(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_NS_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_NS_MASK)

#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_DID_MASK (0x78000000U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_DID_SHIFT (27U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_DID_WIDTH (4U)
#define K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_DID(x) (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_DID_SHIFT)) & K566_GPR1_GPR_ROF_0_AES_RESULT_DID_ERR_DID_MASK)
/*! @} */

/*! @name GPR_ROF_1 - Read Only FUNC 1 */
/*! @{ */

#define K566_GPR1_GPR_ROF_1_CM7_0_GSKT_HLT_MASK  (0x1U)
#define K566_GPR1_GPR_ROF_1_CM7_0_GSKT_HLT_SHIFT (0U)
#define K566_GPR1_GPR_ROF_1_CM7_0_GSKT_HLT_WIDTH (1U)
#define K566_GPR1_GPR_ROF_1_CM7_0_GSKT_HLT(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_1_CM7_0_GSKT_HLT_SHIFT)) & K566_GPR1_GPR_ROF_1_CM7_0_GSKT_HLT_MASK)

#define K566_GPR1_GPR_ROF_1_CM7_1_GSKT_HLT_MASK  (0x2U)
#define K566_GPR1_GPR_ROF_1_CM7_1_GSKT_HLT_SHIFT (1U)
#define K566_GPR1_GPR_ROF_1_CM7_1_GSKT_HLT_WIDTH (1U)
#define K566_GPR1_GPR_ROF_1_CM7_1_GSKT_HLT(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_1_CM7_1_GSKT_HLT_SHIFT)) & K566_GPR1_GPR_ROF_1_CM7_1_GSKT_HLT_MASK)

#define K566_GPR1_GPR_ROF_1_CM7_2_GSKT_HLT_MASK  (0x4U)
#define K566_GPR1_GPR_ROF_1_CM7_2_GSKT_HLT_SHIFT (2U)
#define K566_GPR1_GPR_ROF_1_CM7_2_GSKT_HLT_WIDTH (1U)
#define K566_GPR1_GPR_ROF_1_CM7_2_GSKT_HLT(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_1_CM7_2_GSKT_HLT_SHIFT)) & K566_GPR1_GPR_ROF_1_CM7_2_GSKT_HLT_MASK)

#define K566_GPR1_GPR_ROF_1_CM7_3_GSKT_HLT_MASK  (0x8U)
#define K566_GPR1_GPR_ROF_1_CM7_3_GSKT_HLT_SHIFT (3U)
#define K566_GPR1_GPR_ROF_1_CM7_3_GSKT_HLT_WIDTH (1U)
#define K566_GPR1_GPR_ROF_1_CM7_3_GSKT_HLT(x)    (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_1_CM7_3_GSKT_HLT_SHIFT)) & K566_GPR1_GPR_ROF_1_CM7_3_GSKT_HLT_MASK)

#define K566_GPR1_GPR_ROF_1_INIT_OCM_DONE_MASK   (0x10U)
#define K566_GPR1_GPR_ROF_1_INIT_OCM_DONE_SHIFT  (4U)
#define K566_GPR1_GPR_ROF_1_INIT_OCM_DONE_WIDTH  (1U)
#define K566_GPR1_GPR_ROF_1_INIT_OCM_DONE(x)     (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_1_INIT_OCM_DONE_SHIFT)) & K566_GPR1_GPR_ROF_1_INIT_OCM_DONE_MASK)

#define K566_GPR1_GPR_ROF_1_INT_PEND_MASK        (0x20U)
#define K566_GPR1_GPR_ROF_1_INT_PEND_SHIFT       (5U)
#define K566_GPR1_GPR_ROF_1_INT_PEND_WIDTH       (1U)
#define K566_GPR1_GPR_ROF_1_INT_PEND(x)          (((uint32_t)(((uint32_t)(x)) << K566_GPR1_GPR_ROF_1_INT_PEND_SHIFT)) & K566_GPR1_GPR_ROF_1_INT_PEND_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group K566_GPR1_Register_Masks */

/*!
 * @}
 */ /* end of group K566_GPR1_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_K566_GPR1_H_) */
